<?php
/*Дан массив:

[
	[
		[11, 12, 13],
		[14, 15, 16],
		[17, 17, 19],
	],
	[
		[21, 22, 23],
		[24, 25, 26],
		[27, 27, 29],
	],
	[
		[31, 32, 33],
		[34, 35, 36],
		[37, 37, 39],
	],
]
Найдите сумму элементов этого массива. */
$z = [
	[
		[11, 12, 13],
		[14, 15, 16],
		[17, 17, 19],
	],
	[
		[21, 22, 23],
		[24, 25, 26],
		[27, 27, 29],
	],
	[
		[31, 32, 33],
		[34, 35, 36],
		[37, 37, 39],
	],
];
$k = 0;
for ($i=0; $i<count($z); $i++)
{
	for ($j=0; $j<count($z[$i]); $j++)
	{
		for($g=0; $g<count($z[$i][$j]); $g++)
		{
            $k += $z[$i][$j][$g];
		}
	}
}
echo $k;
$k = 0;
echo "<pre>";
foreach($z as $value)
{
	
	foreach($value as $blya)
	{
		
		foreach($blya as $pidor)
		{
			echo "<pre>";
	    	$k+=$pidor;
		}
	}
}
echo "<pre>";
echo $k;